# Cvičení

## Titanic


V souboru [titanic.csv](data/titanic.csv) najdeš informace o cestujících na zaoceánském parníku Titanic.

In [2]:
import pandas

# načtení dat
data = pandas.read_csv("titanic.csv")
data.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500


Vytvoř kontingenční tabulku, která porovná závislost mezi pohlavím cestujícího (soupec `Sex`) a tím, jesti přežil potopení Titanicu (sloupec `Survived`).

In [2]:
# vytvoření kontingenční tabulky
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Sex", columns=["Survived"], aggfunc=len)
titanic_pivot_table

Survived    0    1
Sex
female     81  233
male      464  109


Dále vytvoř další kontingenční tabulku, která porovná závislost mezi třídou (sloupec `Pclass`), ve které cestoval, a tím, jestli přežil.

In [4]:
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Pclass", columns="Survived", aggfunc=len)
titanic_pivot_table

Survived    0    1
Pclass
1          80  136
2          97   87
3         368  119


Zkus spočítat relativní počty u jednotlivých tabulek.

In [6]:
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="Sex", columns=["Survived"], aggfunc=len, margins=True)
titanic_pivot_table = titanic_pivot_table.div(titanic_pivot_table.iloc[:,-1], axis=0)
titanic_pivot_table

Survived         0         1  All
Sex
female    0.257962  0.742038  1.0
male      0.809773  0.190227  1.0
All       0.614431  0.385569  1.0


Dále yužij metodu `cut` na rozdělení cestujících do věkových skupin (zkus vytvořit např. 4 skupiny, můžeš definovat hranice skupin tak, aby vznikly skupiny děti, teenageři, dospělí a senioři). Urči počet přeživších pro jednotlivé věkové skupiny.

In [8]:
# děti, teenageři, dospělí a senioři
data["age_group"] = pandas.cut(data["Age"], [0, 12, 20, 60, float("inf")], labels=["children", "teenagers", "adults", "senior citizens"])
titanic_pivot_table = pandas.pivot_table(data, values="Name", index="age_group", columns=["Survived"], aggfunc=len)
titanic_pivot_table

Survived           0    1
age_group
children          36   43
teenagers         93   50
adults           395  244
senior citizens   21    5